app/Models/FinanceModel.php

SELECT *
FROM `finance_petty_cash`
WHERE `finance_petty_cash`.`petty_cash_id` = -1
SELECT *
FROM `finance_petty_cash`
---
    public function getPettyCash($PettyCashID = false)
    {
        if ($PettyCashID) {
            return $this->db->table('finance_petty_cash')
                ->where(['finance_petty_cash.petty_cash_id' => $PettyCashID])
                ->get()->getRowArray();
        } else {
            return $this->db->table('finance_petty_cash')
                ->get()->getResultArray();

UPDATE `finance_petty_cash` SET `balance` = 762225
WHERE `petty_cash_id` = -1
---
    public function updatePettyCashBalance($incoming, $pettycashID, $status)
    {
        $pettycash  =  $this->getPettyCash($pettycashID);
        if ($status == 1) {
            $balance = $pettycash['balance'] + $incoming;
        } else {
            $balance = $pettycash['balance'] - $incoming;
        }

        return $this->db->table('finance_petty_cash')->update(['balance' => $balance], ['petty_cash_id' => $pettycashID]);

SELECT *
FROM `finance_capital`
JOIN `investor` ON `finance_capital`.`investor` = `investor`.`investor_id`
---
    public function getCapital($FinanceCapitalID = false)
    {
        if ($FinanceCapitalID) {
            return $this->db->table('finance_capital')
                ->where(['finance_capital.id' => $FinanceCapitalID])
                ->get()->getRowArray();
        } else {
            return $this->db->table('finance_capital')
                ->join('investor', 'finance_capital.investor = investor.investor_id')
                ->get()->getResultArray();

SELECT *
FROM `investor`
---
    public function getInvestor($InvestorID = false)
    {
        if ($InvestorID) {
            return $this->db->table('investor')
                ->where(['investor.investor_id' => $InvestorID])
                ->get()->getRowArray();
        } else {
            return $this->db->table('investor')
                ->get()->getResultArray();

SELECT *
FROM `finance_operational_cost`
WHERE MONTH(transaction_date) = '07'
AND YEAR(transaction_date) = '2024'
---
    public function getOperationalCost($OperationalCostID = false)
    {
        if ($OperationalCostID) {
            return $this->db->table('finance_operational_cost')
                ->where(['finance_operational_cost.id' => $OperationalCostID])
                ->get()->getRowArray();
        } else {
            $month  = date('m');
            $year   = date('Y');
            return $this->db->table('finance_operational_cost')
                ->getWhere(["MONTH(transaction_date)" => $month, "YEAR(transaction_date)" => $year])
                ->getResultArray();

SELECT *
FROM `finance_cost_category`
---
    public function getCostCategories()
    {
        return $this->db->table('finance_cost_category')->get()->getResultArray();

SELECT SUM(`bill`) AS `bill`
FROM `finance_operational_cost`
WHERE MONTH(transaction_date) = '07'
AND YEAR(transaction_date) = '2024'
---
    public function getTotalCostThisMonth()
    {
        $month  = date('m');
        $year   = date('Y');
        return $this->db->table('finance_operational_cost')
            ->selectSum('bill')
            ->getWhere(["MONTH(transaction_date)" => $month, "YEAR(transaction_date)" => $year])
            ->getRowArray();

SELECT SUM(`bill`) AS `bill`
FROM `finance_operational_cost`
WHERE MONTH(transaction_date) = '07'
AND YEAR(transaction_date) = '2024'
AND `branch_id` = 1
---
    public function getTotalCostThisMonthByBranch($branch = false)
    {
        $month  = date('m');
        $year   = date('Y');
        if ($branch) {
            return $this->db->table('finance_operational_cost')
                ->selectSum('bill')
                ->getWhere(["MONTH(transaction_date)" => $month, "YEAR(transaction_date)" => $year, 'branch_id' => $branch])
                ->getRowArray();