app/Models/MasterModel.php

SELECT *
FROM `service_package`
JOIN `services` ON `service_package`.`service` = `services`.`service_id`
WHERE `service_package`.`service_package_id` = '3'
---
    public function getServicePackage($serviceID = null, $packageID = null)
    {
        if ($serviceID) {
            return $this->db->table('service_package')
                ->join('services', 'service_package.service = services.service_id')
                ->where(['service_package.service' => $serviceID])
                ->get()->getResultArray();
        } else if ($packageID) {
            return $this->db->table('service_package')
                ->join('services', 'service_package.service = services.service_id')
                ->where(['service_package.service_package_id' => $packageID])
                ->get()->getRowArray();