app/Models/MasterModel.php

    public function getProductCategories($ProductCategoryID = false)
    {
        if ($ProductCategoryID) {
            return $this->db->table('product_category')
                ->where(['product_category.product_category_id' => $ProductCategoryID])
                ->get()->getRowArray();
        } else {
            return $this->db->table('product_category')
                ->get()->getResultArray();
---
SELECT *
FROM `product_category`

    public function getProducts($ProductsID = false)
    {
        if ($ProductsID) {
            return $this->db->table('products')
                ->where(['products.product_id' => $ProductsID])
                ->get()->getRowArray();
        } else {
            return $this->db->table('products')
                ->where(['products.is_active' => '1'])
                ->get()->getResultArray();
---
SELECT *
FROM `products`
WHERE `products`.`product_id` = '2'
SELECT *
FROM `products`
WHERE `products`.`is_active` = '1'

    public function getServices($ServicesID = false)
    {
        if ($ServicesID) {
            return $this->db->table('sales_order')
                ->join('customers', 'customers.customer_id = sales_order.customer_id')
                ->where(['sales_order.invoice_no' => $ServicesID])
                ->get()->getRowArray();
        } else {
            return $this->db->table('sales_order')
                ->join('customers', 'customers.customer_id = sales_order.customer_id')
                ->where(['status' => 4])
                ->orderBy('order_id', 'DESC')
                ->get()->getResultArray();
---
SELECT *
FROM `sales_order`
JOIN `customers` ON `customers`.`customer_id` = `sales_order`.`customer_id`
WHERE `sales_order`.`invoice_no` = 'SKRPS-01-110824001'
SELECT *
FROM `sales_order`
JOIN `customers` ON `customers`.`customer_id` = `sales_order`.`customer_id`
WHERE `status` = 4
ORDER BY `order_id` DESC

    public function getServiceProduct($ServiceID)
    {
        $order = $this->getServices($ServiceID);
        return $this->db->table('sales_order_product')->getWhere(['order_id' => $order['order_id']])->getResultArray();
---
SELECT *
FROM `sales_order_product`
WHERE `order_id` = '22'