app/Models/SalesModel.php

    public function countCustomer()
    {
        return $this->db->table('customers')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `customers`