app/Models/SalesModel.php

INSERT INTO `sales_order_product` (`sales_order`, `product`, `sales_order_product_name`, `sales_order_quantity`, `sales_order_price`) VALUES (0, '2', 'Us Shortplate Beef', 2, 193000)
INSERT INTO `stock_card` (`product`, `sales_order`, `outcome`, `outcome_nominal`, `description`, `created_at`) VALUES ('2', 'SKRPS/01300724001', 2, 386000, 'Penjualan nomor invoice SKRPS/01300724001', 1722325855)
---
    public function createSalesOrder($dataSalesOrder, $dataSalesOrderProduct)
    {
        // $this->db->transBegin();
        $invoice =  $this->getInvoice();
        $this->db->table('sales_order')->insert([
            'sales_order_invoices'   => $invoice,
            'customer'               => $dataSalesOrder['inputCustomerID'],
            'sales_order_discount'   => $dataSalesOrder['inputDiscount'],
            'sales_order_tax'        => $dataSalesOrder['inputTax'],
            'sales_order_total'      => $dataSalesOrder['inputTotal'],
            'transaction_date'       => date('Y-m-d'),
            'sales_order_created_at' => time(),
        ]);
        $salesOrderID = $this->db->insertID();
        foreach ($dataSalesOrderProduct as $salesOrderProduct) {
            $this->db->table('sales_order_product')->insert([
                'sales_order'               => $salesOrderID,
                'product'                   => $salesOrderProduct['id'],
                'sales_order_product_name'  => $salesOrderProduct['name'],
                'sales_order_quantity'      => $salesOrderProduct['qty'],
                'sales_order_price'         => $salesOrderProduct['price'],
            ]);

            $product = $this->db->table('products')
                ->where(['products.product_id' => $salesOrderProduct['id']])
                ->get()->getRowArray();
            $newStock = $product['product_stock'] - $salesOrderProduct['qty'];

            $this->db->table('products')->update(['product_stock' => $newStock], ['products.product_id' => $salesOrderProduct['id']]);

            $this->db->table('stock_card')->insert([
                'product'         => $salesOrderProduct['id'],
                'sales_order'     => $invoice,
                'outcome'         => $salesOrderProduct['qty'],
                'outcome_nominal' => $salesOrderProduct['subtotal'],
                'description'     => 'Penjualan nomor invoice ' . $invoice,
                'created_at'      => time()
            ]);

SELECT SUM(`service_order_total`) AS `service_order_total`, SUM(`pickup_fee`) AS `pickup_fee`
FROM `service_order`
WHERE MONTH(transaction_date) = '07'
AND YEAR(transaction_date) = '2024'
AND `branch_id` = 1
---
    public function getTotalServiceThisMonthByBranch($branch = false)
    {
        $month  = date('m');
        $year   = date('Y');
        if ($branch) {
            return $this->db->table('service_order')
                ->selectSum('service_order_total')
                ->selectSum('pickup_fee')
                ->getWhere(["MONTH(transaction_date)" => $month, "YEAR(transaction_date)" => $year, 'branch_id' => $branch])
                ->getRowArray();