app/Models/SalesModel.php

    public function getCustomers($CustomersID = false)
    {
        if ($CustomersID) {
            return $this->db->table('customers')
                ->where(['customers.customer_id' => $CustomersID])
                ->get()->getRowArray();
        } else {
            return $this->db->table('customers')
                ->get()->getResultArray();
---
SELECT *
FROM `customers`
WHERE `customers`.`customer_id` = '1'
SELECT *
FROM `customers`

    public function createSalesOrder($dataSalesOrder, $dataSalesOrderProduct)
    {
        $this->db->transBegin();
        $invoice =  $this->getInvoice();
        $this->db->table('sales_order')->insert([
            'invoice_no'             => $invoice,
            'customer_id'            => $dataSalesOrder['inputCustomerID'],
            'order_status'           => 17,
            'sales_order_discount'   => $dataSalesOrder['inputDiscount'],
            'sales_order_tax'        => $dataSalesOrder['inputTax'],
            'total'                  => $dataSalesOrder['inputTotal'],
            'transaction_date'       => date('Y-m-d'),
            'payment_status'         => 1,
            'payment_method'         => $dataSalesOrder['paymentMethod'],
            'notes'                  => '',
            'created_at'             => time(),
        ]);

        $salesOrderID = $this->db->insertID();
        foreach ($dataSalesOrderProduct as $salesOrderProduct) {
            $this->db->table('sales_order_product')->insert([
                'order_id'                  => $salesOrderID,
                'product_id'                => $salesOrderProduct['id'],
                'order_product_name'        => $salesOrderProduct['name'],
                'quantity'                  => $salesOrderProduct['qty'],
                'price'                     => $salesOrderProduct['price'],
                'total'                     => $salesOrderProduct['subtotal'],
            ]);

            $product = $this->db->table('products')
                ->where(['products.product_id' => $salesOrderProduct['id']])
                ->get()->getRowArray();
            $newStock = $product['product_stock'] - $salesOrderProduct['qty'];

            $this->db->table('products')->update(['product_stock' => $newStock], ['products.product_id' => $salesOrderProduct['id']]);
---
INSERT INTO `sales_order` (`sales_order_invoices`, `customer`, `sales_order_discount`, `sales_order_tax`, `sales_order_total`, `transaction_date`, `sales_order_created_at`) VALUES ('SKRPS/01300724001', '1', '0', '38600', '386000', '2024-07-30', 1722325855)
SELECT *
FROM `products`
WHERE `products`.`product_id` = '2'
UPDATE `products` SET `product_stock` = 98
WHERE `products`.`product_id` = '2'

    public function getReservation($ReservationID = false, $transactionDate = false, $status = false)
    {
        if ($ReservationID) {
            return $this->db->table('sales_order')
                ->join('customers', 'sales_order.customer_id = customers.customer_id')
                ->where(['sales_order.order_id' => $ReservationID])
                ->get()->getRowArray();
        } else if ($transactionDate) {
            return $this->db->table('sales_order')
                ->getWhere(['transaction_date' => $transactionDate])->getResultArray();
        } else if ($status && $transactionDate) {
            return $this->db->table('sales_order')
                ->orderBy('order_id', 'DESC')
                ->getWhere(['status' => $status, 'transaction_date' => $transactionDate, 'type' => 2, 'order_status <' => 11])
                ->getResultArray();
        } else if ($status) {
            return $this->db->table('sales_order')->join('customers', 'sales_order.customer_id = customers.customer_id')->orderBy('order_id', 'DESC')->getWhere(['type' => 2, 'order_status <' => 11, 'status' => $status])->getResultArray();
        } else {
            return $this->db->table('sales_order')->join('customers', 'sales_order.customer_id = customers.customer_id')->orderBy('order_id', 'DESC')->getWhere(['type' => 2, 'order_status <' => 11,])->getRowArray();
---
SELECT *
FROM `sales_order`
JOIN `customers` ON `sales_order`.`customer_id` = `customers`.`customer_id`
WHERE `sales_order`.`order_id` = '8'
SELECT *
FROM `sales_order`
JOIN `customers` ON `sales_order`.`customer_id` = `customers`.`customer_id`
WHERE `type` = 2
AND `order_status` < 11
AND `status` = '1'
ORDER BY `order_id` DESC

    public function getReservationDetailByID($ReservationID = false)
    {
        return $this->db->table('sales_order_product')
            ->where(['sales_order_product.order_id' => $ReservationID])
            ->get()->getResultArray();
---
SELECT *
FROM `sales_order_product`
WHERE `sales_order_product`.`order_id` = '8'

    public function getTotalServiceThisMonth()
    {
        $month  = date('m');
        $year   = date('Y');
        return $this->db->table('sales_order')
            ->selectSum('total')
            ->selectSum('cost_delivery')
            ->selectSum('sales_order_discount')
            ->getWhere(["MONTH(transaction_date)" => $month, "YEAR(transaction_date)" => $year])
            ->getRowArray();
---
SELECT SUM(`total`) AS `total`, SUM(`cost_delivery`) AS `cost_delivery`, SUM(`sales_order_discount`) AS `sales_order_discount`
FROM `sales_order`
WHERE MONTH(transaction_date) = '07'
AND YEAR(transaction_date) = '2024'

    public function getTotalDiscountServiceThisMonthByBranch($branch = false)
    {
        $month  = date('m');
        $year   = date('Y');
        if ($branch) {
            return $this->db->table('service_order')
                ->selectSum('service_order_discount')
                ->getWhere(["MONTH(transaction_date)" => $month, "YEAR(transaction_date)" => $year, 'branch_id' => $branch])
                ->getRowArray();
        } else {
            return $this->db->table('service_order')
                ->selectSum('service_order_discount')
                ->getWhere(["MONTH(transaction_date)" => $month, "YEAR(transaction_date)" => $year])
                ->getRowArray();
---
SELECT SUM(`service_order_discount`) AS `service_order_discount`
FROM `service_order`
WHERE MONTH(transaction_date) = '07'
AND YEAR(transaction_date) = '2024'
AND `branch_id` = 1

    public function countCustomer()
    {
        return $this->db->table('customers')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `customers`

    public function getTotalServiceByDayandBranch($branch)
    {
        $month  = date('m');
        $year   = date('Y');
        return $this->db->table('service_order')
            ->select('transaction_date')->selectSum('service_order_total')->selectSum('pickup_fee')->selectSum('service_order_discount')
            ->where(["MONTH(transaction_date)" => $month, "YEAR(transaction_date)" => $year, 'branch_id' => $branch])
            ->groupBy('transaction_date')
            ->get()->getResultArray();
---
SELECT `transaction_date`, SUM(`service_order_total`) AS `service_order_total`, SUM(`pickup_fee`) AS `pickup_fee`, SUM(`service_order_discount`) AS `service_order_discount`
FROM `service_order`
WHERE MONTH(transaction_date) = '07'
AND YEAR(transaction_date) = '2024'
AND `branch_id` = 1
GROUP BY `transaction_date`

    public function getServiceToday($day)
    {
        return $this->db->table('service_order')
            ->join('customers', 'service_order.customer = customers.customer_id')
            ->orderBy('transaction_date', 'DESC')
            ->getWhere(['transaction_date' => $day])->getResultArray();
---
SELECT *
FROM `service_order`
JOIN `customers` ON `service_order`.`customer` = `customers`.`customer_id`
WHERE `transaction_date` = '2024-07-03'
ORDER BY `transaction_date` DESC